<?php
$str1 = "элемент - $arf[0] --)элемент - $arf[1] --)элемент - $arf[2] --)элемент - $arf[3] --)элемент - $arf[4] --)элемент - $arf[5] --)элемент - $arf[6] --)элемент - $arf[7] --)элемент - $arf[8] --)элемент - $arf[9] --)элемент - $arf[10] --)элемент - $arf[11] --)элемент - $arf[12] --)элемент - $arf[13] --)элемент - $arf[14] --)элемент - $arf[15] --)элемент - $arf[16] --)элемент - $arf[17] --)элемент - $arf[18] --)элемент - $arf[19] --)элемент - $arf[20] --)элемент - $arf[21] --)элемент - $arf[22] --)элемент - $arf[23] --)элемент - $arf[24] --)элемент - $arf[25] --)элемент - $arf[26] --)элемент - $arf[27] --)элемент - $arf[28] --)элемент - $arf[29] --)элемент - $arf[30] --)элемент - $arf[31] --)элемент - $arf[32] --)элемент - $arf[33] --)элемент - $arf[34] --)элемент - $arf[35] --)элемент - $arf[36] --)элемент - $arf[37] --)элемент - $arf[38] --)элемент - $arf[39] --)элемент - $arf[40] --)элемент - $arf[41] --)элемент - $arf[42] --)элемент - $arf[43] --)элемент - $arf[44] --)элемент - $arf[45] --)элемент - $arf[46] --)элемент - $arf[47] --)элемент - $arf[48] --)элемент - $arf[49] --)";
$str2 = 'элемент - '.$arf[0].' --)элемент - '.$arf[1].' --)элемент - '.$arf[2].' --)элемент - '.$arf[3].' --)элемент - '.$arf[4].' --)элемент - '.$arf[5].' --)элемент - '.$arf[6].' --)элемент - '.$arf[7].' --)элемент - '.$arf[8].' --)элемент - '.$arf[9].' --)элемент - '.$arf[10].' --)элемент - '.$arf[11].' --)элемент - '.$arf[12].' --)элемент - '.$arf[13].' --)элемент - '.$arf[14].' --)элемент - '.$arf[15].' --)элемент - '.$arf[16].' --)элемент - '.$arf[17].' --)элемент - '.$arf[18].' --)элемент - '.$arf[19].' --)элемент - '.$arf[20].' --)элемент - '.$arf[21].' --)элемент - '.$arf[22].' --)элемент - '.$arf[23].' --)элемент - '.$arf[24].' --)элемент - '.$arf[25].' --)элемент - '.$arf[26].' --)элемент - '.$arf[27].' --)элемент - '.$arf[28].' --)элемент - '.$arf[29].' --)элемент - '.$arf[30].' --)элемент - '.$arf[31].' --)элемент - '.$arf[32].' --)элемент - '.$arf[33].' --)элемент - '.$arf[34].' --)элемент - '.$arf[35].' --)элемент - '.$arf[36].' --)элемент - '.$arf[37].' --)элемент - '.$arf[38].' --)элемент - '.$arf[39].' --)элемент - '.$arf[40].' --)элемент - '.$arf[41].' --)элемент - '.$arf[42].' --)элемент - '.$arf[43].' --)элемент - '.$arf[44].' --)элемент - '.$arf[45].' --)элемент - '.$arf[46].' --)элемент - '.$arf[47].' --)элемент - '.$arf[48].' --)элемент - '.$arf[49].' --)';
$str = '';

for($i = 0; $i < 50; ++$i){
	$arf[] = rand_string(6);
	$str .= 'элемент - \'.$arf['.$i.'].\' --)';
}

$start1 = microtime(true);	//вывод через двойные кавычки
echo "<br>элемент - $arf[0] --)элемент - $arf[1] --)элемент - $arf[2] --)элемент - $arf[3] --)элемент - $arf[4] --)элемент - $arf[5] --)элемент - $arf[6] --)элемент - $arf[7] --)элемент - $arf[8] --)элемент - $arf[9] --)элемент - $arf[10] --)элемент - $arf[11] --)элемент - $arf[12] --)элемент - $arf[13] --)элемент - $arf[14] --)элемент - $arf[15] --)элемент - $arf[16] --)элемент - $arf[17] --)элемент - $arf[18] --)элемент - $arf[19] --)элемент - $arf[20] --)элемент - $arf[21] --)элемент - $arf[22] --)элемент - $arf[23] --)элемент - $arf[24] --)элемент - $arf[25] --)элемент - $arf[26] --)элемент - $arf[27] --)элемент - $arf[28] --)элемент - $arf[29] --)элемент - $arf[30] --)элемент - $arf[31] --)элемент - $arf[32] --)элемент - $arf[33] --)элемент - $arf[34] --)элемент - $arf[35] --)элемент - $arf[36] --)элемент - $arf[37] --)элемент - $arf[38] --)элемент - $arf[39] --)элемент - $arf[40] --)элемент - $arf[41] --)элемент - $arf[42] --)элемент - $arf[43] --)элемент - $arf[44] --)элемент - $arf[45] --)элемент - $arf[46] --)элемент - $arf[47] --)элемент - $arf[48] --)элемент - $arf[49] --)";
$end1 = (microtime(true) - $start1)*1000 ;

$start2 = microtime(true);	//вывод через одинарные кавычки
echo '<br>элемент - '.$arf[0].' --)элемент - '.$arf[1].' --)элемент - '.$arf[2].' --)элемент - '.$arf[3].' --)элемент - '.$arf[4].' --)элемент - '.$arf[5].' --)элемент - '.$arf[6].' --)элемент - '.$arf[7].' --)элемент - '.$arf[8].' --)элемент - '.$arf[9].' --)элемент - '.$arf[10].' --)элемент - '.$arf[11].' --)элемент - '.$arf[12].' --)элемент - '.$arf[13].' --)элемент - '.$arf[14].' --)элемент - '.$arf[15].' --)элемент - '.$arf[16].' --)элемент - '.$arf[17].' --)элемент - '.$arf[18].' --)элемент - '.$arf[19].' --)элемент - '.$arf[20].' --)элемент - '.$arf[21].' --)элемент - '.$arf[22].' --)элемент - '.$arf[23].' --)элемент - '.$arf[24].' --)элемент - '.$arf[25].' --)элемент - '.$arf[26].' --)элемент - '.$arf[27].' --)элемент - '.$arf[28].' --)элемент - '.$arf[29].' --)элемент - '.$arf[30].' --)элемент - '.$arf[31].' --)элемент - '.$arf[32].' --)элемент - '.$arf[33].' --)элемент - '.$arf[34].' --)элемент - '.$arf[35].' --)элемент - '.$arf[36].' --)элемент - '.$arf[37].' --)элемент - '.$arf[38].' --)элемент - '.$arf[39].' --)элемент - '.$arf[40].' --)элемент - '.$arf[41].' --)элемент - '.$arf[42].' --)элемент - '.$arf[43].' --)элемент - '.$arf[44].' --)элемент - '.$arf[45].' --)элемент - '.$arf[46].' --)элемент - '.$arf[47].' --)элемент - '.$arf[48].' --)элемент - '.$arf[49].' --)';
$end2 = (microtime(true) - $start2)*1000 ;


echo "<br>Двойные кавычки $end1 секунд\n";

echo "<br>Одиночные кавычки $end2 секунд\n";


function rand_string($length = 10) {
    $str = '0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ';
    $str_leng = strlen($str);
    $rand_str = '';
    for ($i = 0; $i < $length; $i++) {
        $rand_str .= $str[rand(0, $str_leng - 1)];
    }
    return $rand_str;
}
